#
# slash_flashcard.py
#


import random
import os
import discord
from discord.ext import commands

from .util.binary_enum import EphemeralEnum
from .flashcard.init_flashcard import (
    _FLASHCARD_P_DRINKS,
    _FLASHCARD_P_ITEMS_FREQ,
    _FLASHCARD_P_ITEMS,
)


SKILLCARD_FLASHCARD_FREQ = {
    "desc": "よく使われるスキルカード",

    # N
    "(A)アピールの基本 ♡-4": "* パラメータ+9",
    "(A)アピールの基本+ ♡-3": "* パラメータ+14",
    "(A)ポーズの基本 ♡-3": "* パラメータ+2 __**元気**__+2",
    "(A)ポーズの基本+ ♡-3": "* パラメータ+6 __**元気**__+4",
    "(A)挑戦 ♡-7": "* __**好調**__状態の場合、使用可\n* パラメータ+25\n* __**レッスン中1回**__",
    "(A)挑戦+ ♡-7": "* __**好調**__状態の場合、使用可\n* パラメータ+37\n* __**レッスン中1回**__",
    "(A)試行錯誤 ♡-7": "* パラメータ+8（2回）\n* __**レッスン中1回**__",
    "(A)試行錯誤+ ♡-5": "* パラメータ+10（2回）\n* __**レッスン中1回**__",
    "(A)可愛い仕草 ♡-5": "* __**好印象**__+2\n* __**好印象**__の100%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)可愛い仕草+ ♡-5": "* __**好印象**__+3\n* __**好印象**__の120%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)気分転換 ♡-5": "* __**体力消費**__5\n* __**元気**__の100%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)気分転換+ ♡-3": "* __**体力消費**__3\n* __**元気**__の110%分パラメータ上昇\n* __**レッスン中1回**__",
    "(M)表現の基本 ♡0": "* __**元気**__+4\n* __**レッスン中1回**__",
    "(M)表現の基本+ ♡0": "* __**元気**__+7\n* __**レッスン中1回**__",
    "(M)振る舞いの基本 ♡-1": "* __**元気**__+1\n* __**好調**__2ターン",
    "(M)振る舞いの基本+ ♡-1": "* __**元気**__+1\n* __**好調**__3ターン",
    "(M)表情の基本 ♡-1": "* __**元気**__+1\n* __**集中**__+2",
    "(M)表情の基本+ ♡-1": "* __**元気**__+1\n* __**集中**__+3",
    "(M)目線の基本 ♡-2": "* __**元気**__+1\n* __**好印象**__+2",
    "(M)目線の基本+ ♡-2": "* __**元気**__+2\n* __**好印象**__+3",
    "(M)意識の基本 ♡-2": "* __**元気**__+1\n* __**やる気**__+2",
    "(M)意識の基本+ ♡-2": "* __**元気**__+2\n* __**やる気**__+3",
    "(T)眠気 ♡0": "* __**レッスン内1回**__",

    # R Active
    "(A)軽い足取り ♡-4": "* パラメータ+6\n* __**好調**__2ターン",
    "(A)軽い足取り+ ♡-4": "* パラメータ+9\n* __**好調**__3ターン",
    "(A)愛嬌 ♡-4": "* パラメータ+13",
    "(A)愛嬌+ ♡-4": "* パラメータ+21",
    "(A)準備運動 ♡-4": "* パラメータ+6\n* __**集中**__+2",
    "(A)準備運動+ ♡-4": "* パラメータ+9\n* __**集中**__+3",
    "(A)ファンサ ♡-2": "* パラメータ+10",
    "(A)ファンサ+ ♡-2": "* パラメータ+16",
    "(A)勢い任せ ♡-4": "* パラメータ+6\n* __**集中**__+3",
    "(A)勢い任せ+ ♡-4": "* パラメータ+9\n* __**集中**__+4",
    "(A)ハイタッチ ♡-4": "* パラメータ+17（__**集中**__効果を1.5倍適用）\n* __**レッスン中1回**__",
    "(A)ハイタッチ+ ♡-4": "* パラメータ+23（__**集中**__効果を2倍適用）\n* __**レッスン中1回**__",
    "(A)トークタイム ♡-6": "* __**好調**__状態の場合、使用可\n* パラメータ+27\n* __**レッスン中1回**__",
    "(A)トークタイム+ ♡-6": "* __**好調**__状態の場合、使用可\n* パラメータ+38\n* __**レッスン中1回**__",
    "(A)今日もおはよう ♡-4": "* パラメータ+7\n* __**好印象**__+3",
    "(A)今日もおはよう+ ♡-4": "* パラメータ+9\n* __**好印象**__+4",
    "(A)ゆるふわおしゃべり ♡-4": "* __**体力消費**__4\n* __**やる気**__+3\n* __**元気**__の60%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)ゆるふわおしゃべり+ ♡-4": "* __**体力消費**__4\n* __**やる気**__+4\n* __**元気**__の80%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)もう少しだけ ♡-5": "* パラメータ+10\n* __**やる気**__+3",
    "(A)もう少しだけ+ ♡-5": "* パラメータ+15\n* __**やる気**__+4",
    "(A)手拍子 ♡-5": "* __**好印象**__の150%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)手拍子+ ♡-5": "* __**好印象**__の200%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)元気な挨拶 ♡-4": "* __**体力消費**__4\n* __**元気**__の110%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)元気な挨拶+ ♡-3": "* __**体力消費**__3\n* __**元気**__の120%分パラメータ上昇\n* __**レッスン中1回**__",

    # R Mental
    "(M)気合十分！ ♡0": "* __**元気**__+2\n* __**消費体力減少**__2ターン",
    "(M)気合十分！+ ♡0": "* __**元気**__+2\n* __**消費体力減少**__3ターン",
    "(M)ファーストステップ ♡0": "* __**元気**__+3\n* 体力が50%以上の場合、__**消費体力削減**__1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ファーストステップ+ ♡0": "* __**元気**__+6\n* 体力が50%以上の場合、__**消費体力削減**__1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)バランス感覚 ♡-2": "* __**集中**__+3",
    "(M)バランス感覚+ ♡-2": "* __**元気**__+1\n* __**集中**__+4",
    "(M)楽観的 ♡-2": "* __**好調**__3ターン\n* __**好調**__状態の場合、__**集中**__+1",
    "(M)楽観的+ ♡-2": "* __**好調**__4ターン\n* __**好調**__状態の場合、__**集中**__+1",
    "(M)深呼吸 ♡-3": "* __**集中**__+2\n* __**集中**__が3以上の場合、__**好調**__3ターン",
    "(M)深呼吸+ ♡-3": "* __**集中**__+3\n* __**集中**__が3以上の場合、__**好調**__3ターン",
    "(M)ひと呼吸 ♡-7": "* __**好調**__3ターン\n* __**集中**__+4\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ひと呼吸+ ♡-7": "* __**好調**__4ターン\n* __**集中**__+5\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)リスタート ♡-4": "* __**元気**__+2\n* __**好印象**__+3",
    "(M)リスタート+ ♡-3": "* __**元気**__+2\n* __**好印象**__+4",
    "(M)えいえいおー ♡-2": "* __**元気**__+1\n* __**やる気**__+3",
    "(M)えいえいおー+ ♡-2": "* __**元気**__+2\n* __**やる気**__+4",
    "(M)リズミカル ♡0": "* __**元気**__+6\n* __**レッスン中1回**__",
    "(M)リズミカル+ ♡0": "* __**元気**__+8\n* __**レッスン中1回**__",
    "(M)思い出し笑い ♡-2": "* __**好印象**__+3\n* __**好印象**__が3以上の場合、__**やる気**__+2",
    "(M)思い出し笑い+ ♡-2": "* __**好印象**__+4\n* __**好印象**__が3以上の場合、__**やる気**__+3",
    "(M)パステル気分 ♡-3": "* __**元気**__+5\n* __**やる気**__が3以上の場合、__**好印象**__+3",
    "(M)パステル気分+ ♡-3": "* __**元気**__+7\n* __**やる気**__が3以上の場合、__**好印象**__+4",
    "(M)励まし ♡-4": "* __**やる気**__+3\n* __**やる気**__が6以上の場合、__**好印象**__+4",
    "(M)励まし+ ♡-4": "* __**やる気**__+4\n* __**やる気**__が6以上の場合、__**好印象**__+5",
    "(M)幸せのおまじない ♡-8": "* __**好印象**__+7\n* __**レッスン中1回**__",
    "(M)幸せのおまじない+ ♡-8": "* __**好印象**__+9\n* __**レッスン中1回**__",

    # SR Active
    "(A)前途洋々 ♡-4": "* パラメータ+8 __**元気**__+7",
    "(A)前途洋々+ ♡-4": "* パラメータ+12 __**元気**__+10",
    "(A)決めポーズ ♡-3": "* パラメータ+18\n* __**レッスン中1回**__",
    "(A)決めポーズ+ ♡-3": "* パラメータ+27\n* __**レッスン中1回**__",
    "(A)アドリブ ♡-4": "* パラメータ+5\n* __**好調**__3ターン",
    "(A)アドリブ+ ♡-4": "* パラメータ+9\n* __**好調**__4ターン",
    "(A)情熱ターン ♡-6": "* パラメータ+11\n* __**集中**__+3",
    "(A)情熱ターン+ ♡-6": "* パラメータ+18\n* __**集中**__+4",
    "(A)飛躍 ♡-5": "* パラメータ+13\n* __**集中**__が6以上の場合、パラメータ+15\n* __**レッスン中1回**__",
    "(A)飛躍+ ♡-2": "* パラメータ+13\n* __**集中**__が6以上の場合、パラメータ+15\n* __**レッスン中1回**__",
    "(A)祝福 ♡-4": "* __**体力消費**__4\n* パラメータ+26\n* __**好調**__1ターン\n* __**レッスン中1回**__",
    "(A)祝福+ ♡-4": "* __**体力消費**__4\n* パラメータ+40\n* __**好調**__1ターン\n* __**レッスン中1回**__",
    "(A)スタートダッシュ ♡-5": "* パラメータ+30 __**元気**__+10\n* __**消費体力増加**__2ターン\n* __**重複不可**__",
    "(A)スタートダッシュ+ ♡-5": "* パラメータ+40 __**元気**__+10\n* __**消費体力増加**__2ターン\n* __**重複不可**__",
    "(A)スタンドプレー ♡-5": "* パラメータ+12 __**元気**__+7\n* __**集中**__+5\n* __**消費体力増加**__2ターン\n* __**重複不可**__",
    "(A)スタンドプレー+ ♡-5": "* パラメータ+12 __**元気**__+7\n* __**集中**__+7\n* __**消費体力増加**__2ターン\n* __**重複不可**__",
    "(A)シュプレヒコール (集中-3)": "* __**集中**__消費3\n* パラメータ+6\n* __**好調**__2ターン\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    "(A)シュプレヒコール+ (集中-2)": "* __**集中**__消費2\n* パラメータ+6\n* __**好調**__3ターン\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    "(A)立ち位置チェック (集中-3)": "* __**集中**__消費3\n* パラメータ+25 __**元気**__+15\n* __**元気増加無効**__2ターン\n* __**レッスン中1回**__",
    "(A)立ち位置チェック+ (集中-3)": "* __**集中**__消費3\n* パラメータ+40 __**元気**__+15\n* __**元気増加無効**__2ターン\n* __**レッスン中1回**__",
    "(A)ラブリーウィンク ♡-5": "* __**好印象**__+4\n* __**好印象**__の60%分パラメータ上昇",
    "(A)ラブリーウィンク+ ♡-5": "* __**好印象**__+5\n* __**好印象**__の80%分パラメータ上昇",
    "(A)ありがとうの言葉 ♡-3": "* __**体力消費**__3\n* __**元気**__+9\n* __**元気**__の40%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)ありがとうの言葉+ ♡-3": "* __**体力消費**__3\n* __**元気**__+11\n* __**元気**__の70%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)ハートの合図 ♡-3": "* __**体力消費**__3\n* __**元気**__を半分にして、減少前の__**元気**__の130%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)ハートの合図+ ♡-3": "* __**体力消費**__3\n* __**元気**__を半分にして、減少前の__**元気**__の180%分パラメータ上昇\n* __**レッスン中1回**__",
    "(A)キラメキ ♡-3": "* __**元気**__+5\n* __**好印象**__の200%分パラメータ上昇\n* __**消費体力増加**__2ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)キラメキ+ ♡-3": "* __**元気**__+5\n* __**好印象**__の250%分パラメータ上昇\n* __**消費体力増加**__2ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)みんな大好き (やる気-3)": "* __**やる気**__消費3\n* __**好印象**__の90%分パラメータ上昇\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    "(A)みんな大好き+ (やる気-2)": "* __**やる気**__消費2\n* __**好印象**__の120%分パラメータ上昇\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    
    # SR Mental
    "(M)アイドル宣言 ♡-1": "* __**体力消費**__1\n* __**スキルカード使用数追加**__+1\n* スキルカードを2枚引く\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)アイドル宣言+ ♡0": "* __**スキルカード使用数追加**__+1\n* スキルカードを2枚引く\n* __**消費体力減少**__1ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ハイテンション ♡0": "* __**元気+11**__\n __**元気増加無効**__2ターン\n* __**消費体力減少**__3ターン\n* __**レッスン中1回**__",
    "(M)ハイテンション+ ♡0": "* __**元気+13**__\n __**元気増加無効**__2ターン\n* __**消費体力減少**__4ターン\n* __**レッスン中1回**__",
    "(M)眼力 ♡-3": "* __**元気**__+6\n* __**集中**__+3\n* __**レッスン中1回**__",
    "(M)眼力+ ♡-3": "* __**元気**__+8\n* __**集中**__+4\n* __**レッスン中1回**__",
    "(M)大声援 ♡-3": "* __**元気**__+6\n* __**好調**__3ターン\n* __**レッスン中1回**__",
    "(M)大声援+ ♡-3": "* __**元気**__+8\n* __**好調**__4ターン\n* __**レッスン中1回**__",
    "(M)演出計画 ♡-4": "* __**絶好調**__3ターン\n* 以降、__**アクティブスキルカード**__使用時、__**固定元気**__+2\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)演出計画+ ♡-3": "* __**絶好調**__4ターン\n* 以降、__**アクティブスキルカード**__使用時、__**固定元気**__+2\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)願いの力 ♡-4": "* __**集中**__+2\n* 以降、__**アクティブスキルカード**__使用時、__**集中**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)願いの力+ ♡-3": "* __**集中**__+3\n* 以降、__**アクティブスキルカード**__使用時、__**集中**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)静かな意志 ♡-4": "* レッスン開始時手札に入る\n* __**集中**__+3\n* __**好調**__2ターン\n* __**レッスン中1回**__",
    "(M)静かな意志+ ♡-4": "* レッスン開始時手札に入る\n* __**集中**__+4\n* __**好調**__3ターン\n* __**レッスン中1回**__",
    "(M)始まりの合図 ♡-3": "* __**好調**__5ターン\n* __**レッスン中1回**__",
    "(M)始まりの合図+ ♡-3": "* __**好調**__7ターン\n* __**レッスン中1回**__",
    "(M)意地 ♡-2": "* __**元気**__+3\n* __**集中**__+4\n* __**レッスン中1回**__",
    "(M)意地+ ♡-2": "* __**元気**__+5\n* __**集中**__+5\n* __**レッスン中1回**__",
    "(M)存在感 (好調-2)": "* __**好調**__消費2ターン\n* __**集中**__+4\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    "(M)存在感+ (好調-1)": "* __**好調**__消費1ターン\n* __**集中**__+5\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    "(M)成功への道筋 (好調-2)": "* __**好調**__消費2ターン\n* __**元気**__+2\n* __**集中**__+7\n* __**レッスン中1回**__",
    "(M)成功への道筋+ (好調-2)": "* __**好調**__消費2ターン\n* __**元気**__+4\n* __**集中**__+9\n* __**レッスン中1回**__",
    "(M)スポットライト ♡-3": "* __**体力消費**__3\n* __**元気**__+7\n* __**好調**__4ターン",
    "(M)スポットライト+ ♡-3": "* __**体力消費**__3\n* __**元気**__+9\n* __**好調**__5ターン",
    "(M)あふれる思い出 ♡-3": "* __**元気**__+2\n* __**やる気**__+4",
    "(M)あふれる思い出+ ♡-3": "* __**元気**__+4\n* __**やる気**__+5",
    "(M)ふれあい ♡-5": "* __**元気**__+3\n* __**好印象**__+4",
    "(M)ふれあい+ ♡-5": "* __**元気**__+6\n* __**好印象**__+5",
    "(M)幸せな時間 ♡-5": "* __**好印象**__+6",
    "(M)幸せな時間+ ♡-5": "* __**好印象**__+8",
    "(M)ファンシーチャーム ♡-4": "* __**好印象**__+3\n* 以降、__**メンタルスキルカード**__使用時、__**好印象**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ファンシーチャーム+ ♡-4": "* __**好印象**__+5\n* 以降、__**メンタルスキルカード**__使用時、__**好印象**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ワクワクが止まらない ♡-3": "* __**やる気**__+3\n* 以降、__**メンタルスキルカード**__使用時、__**やる気**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ワクワクが止まらない+ ♡-3": "* __**やる気**__+5\n* 以降、__**メンタルスキルカード**__使用時、__**やる気**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)本番前夜 ♡-5": "* レッスン開始時手札に入る\n* __**好印象**__+4\n* __**やる気**__+3\n* __**レッスン中1回**__",
    "(M)本番前夜+ ♡-5": "* レッスン開始時手札に入る\n* __**好印象**__+5\n* __**やる気**__+4\n* __**レッスン中1回**__",
    "(M)ひなたぼっこ ♡0": "* __**元気**__+11\n* __**やる気**__+5\n* __**消費体力増加**__2ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ひなたぼっこ+ ♡0": "* __**元気**__+11\n* __**やる気**__+7\n* __**消費体力増加**__2ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)イメトレ ♡-4": "* __**元気**__+7\n* __**やる気**__+4\n* __**レッスン中1回**__",
    "(M)イメトレ+ ♡-4": "* __**元気**__+11\n* __**やる気**__+5\n* __**レッスン中1回**__",
    "(M)やる気は満点 ♡-1": "* __**元気**__+1\n* __**好印象**__+4\n* __**レッスン中1回**__",
    "(M)やる気は満点+ ♡-1": "* __**元気**__+2\n* __**好印象**__+5\n* __**レッスン中1回**__",
    "(M)ゆめみごこち (好印象-2)": "* __**好印象**__消費2\n* __**やる気**__+4\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    "(M)ゆめみごこち+ (好印象-1)": "* __**好印象**__消費1\n* __**やる気**__+5\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    "(M)止められない想い ♡-4": "* __**体力**__消費4\n* __**やる気**__+3\n* __**好印象**__+3\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)止められない想い+ ♡-4": "* __**体力**__消費4\n* __**やる気**__+4\n* __**好印象**__+5\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)オトメゴコロ (やる気-3)": "* __**やる気**__消費3\n* __**好印象**__+4\n* __**スキルカード使用数追加**__+1\n* __**重複不可**__",
    "(M)オトメゴコロ+ (やる気-3)": "* __**やる気**__消費3\n* __**好印象**__+5\n* __**スキルカード使用数追加**__+1\n* __**好印象**__が10以上の場合、__**好印象**__+2\n* __**重複不可**__",

    # SSR Active
    "(A)コール＆レスポンス ♡-6": "* パラメータ+15*\n* __**集中**__が3以上の場合、パラメータ+15\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)コール＆レスポンス+ ♡-6": "* パラメータ+15*\n* __**集中**__が3以上の場合、パラメータ+34（__**集中**__効果を1.5倍適用）\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)バズワード ♡-7": "* __**好調**__状態の場合、使用可\n* パラメータ+38\n* __**重複不可**__",
    "(A)バズワード+ ♡-7": "* __**好調**__状態の場合、使用可\n* パラメータ+54\n* __**重複不可**__",
    "(A)成就 ♡-10": "* __**好調**__4ターン\n* 次のターン、パラメータ+32\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)成就+ ♡-10": "* __**好調**__7ターン\n* 次のターン、パラメータ+40\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)魅惑のパフォーマンス ♡-8": "* __**好調**__状態の場合、使用可\n* __**絶好調**__2ターン\n* 次のターン、パラメータ+38\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)魅惑のパフォーマンス+ ♡-7": "* __**好調**__状態の場合、使用可\n* __**絶好調**__3ターン\n* 次のターン、パラメータ+47\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)至高のエンタメ (集中-3)": "* __**集中**__消費3\n* 以降、__**アクティブスキルカード**__使用時、パラメータ+4\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)至高のエンタメ+ (集中-2)": "* __**集中**__消費2\n* 次のターン、スキルカードを引く\n* 以降、__**アクティブスキルカード**__使用時、パラメータ+5\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)覚醒 (好調-1)": "* __**好調**__消費1ターン\n* パラメータ+3（2回）\n* __**集中**__+4\n* __**重複不可**__",
    "(A)覚醒+ (好調-1)": "* __**好調**__消費1ターン\n* パラメータ+4（2回）\n* __**集中**__+6\n* __**重複不可**__",
    "(A)200%スマイル ♡-6": "* __**好印象**__+5\n* __**好印象**__の100%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)200%スマイル+ ♡-6": "* __**好印象**__+6\n* __**好印象**__の170%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)開花 ♡-5": "* __**やる気**__+6\n* __**やる気**__の200%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)開花+ ♡-6": "* __**やる気**__+8\n* __**やる気**__の300%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)届いて！ ♡-2": "* __**体力消費**__2\n* __**元気**__を0にして、減少前の__**元気**__の160%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)届いて！+ ♡-2": "* __**体力消費**__2\n* __**元気**__を0にして、減少前の__**元気**__の220%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)輝くキミへ (やる気-4)": "* __**やる気**__消費4\n* __**スキルカード使用数追加**__+1\n* 以降、スキルカード使用時、__**好印象**__の30%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)輝くキミへ+ (やる気-4)": "* __**やる気**__消費4\n* __**スキルカード使用数追加**__+1\n* 以降、スキルカード使用時、__**好印象**__の50%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)あのときの約束 (好印象-4)": "* __**好印象**__消費4\n* __**元気**__+9\n* __**元気**__の100%分パラメータ上昇\n* __**やる気**__の150%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)あのときの約束+ (好印象-4)": "* __**好印象**__消費4\n* __**元気**__+14\n* __**元気**__の130%分パラメータ上昇\n* __**やる気**__の200%分パラメータ上昇\n* __**レッスン中1回**__ __**重複不可**__",

    # SSR Mental
    "(M)テレビ出演 ♡-1": "* __**元気**__+3\n* __**消費体力減少**__4ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)テレビ出演+ ♡-1": "* __**元気**__+5\n* __**消費体力減少**__5ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)叶えたい夢 ♡-1": "* __**体力消費**__1\n* __**元気**__+8\n* __**消費体力削減**__1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)叶えたい夢+ ♡-1": "* __**体力消費**__1\n* __**元気**__+9\n* __**消費体力削減**__2\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)アイドル魂 ♡-2": "* レッスン開始時手札に入る\n* __**元気**__+6\n* __**低下状態無効**__1回\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)アイドル魂+ ♡-2": "* レッスン開始時手札に入る\n* __**元気**__+6\n* __**低下状態無効**__1回\n* 次のターン、手札をすべて__**レッスン中強化**__\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)仕切り直し ♡-5": "* 手札をすべて入れ替える\n* __**消費体力減少**__4ターン\n* __**スキルカード使用数追加**__+1\n* スキルカードを2枚引く\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)仕切り直し+ ♡-2": "* 手札をすべて入れ替える\n* __**消費体力減少**__4ターン\n* __**スキルカード使用数追加**__+1\n* スキルカードを2枚引く\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)国民的アイドル (好調-1)": "* __**好調**__消費1ターン\n* 次に使用するスキルカードの効果をもう1回発動（1回）\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)国民的アイドル+ (好調-1)": "* __**好調**__消費1ターン\n* __**元気**__+8\n* 次に使用するスキルカードの効果をもう1回発動（1回）\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)魅惑の視線 (集中-3)": "* __**集中**__消費3\n* __**絶好調**__4ターン\n* __**消費体力減少**__2ターン\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)魅惑の視線+ (集中-3)": "* __**集中**__消費3\n* __**絶好調**__5ターン\n* __**消費体力減少**__5ターン\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)鳴り止まない拍手 ♡-5": "* __**集中**__+4\n* __**好調**__2ターン\n* __**消費体力減少**__2ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)鳴り止まない拍手+ ♡-5": "* __**集中**__+5\n* __**好調**__3ターン\n* __**消費体力減少**__3ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)天真爛漫 ♡-6": "* __**集中**__+1\n* 以降、ターン終了時、__**集中**__が3以上の場合、__**集中**__+2\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)天真爛漫+ ♡-3": "* __**集中**__+1\n* 以降、ターン終了時、__**集中**__が3以上の場合、__**集中**__+2\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)私がスター (好印象-2)": "* __**好印象**__消費2\n* __**ターン追加**__+1\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)私がスター+ (好印象-1)": "* __**好印象**__消費1\n* __**ターン追加**__+1\n* __**スキルカード使用数追加**__+1\n* スキルカードを引く\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)星屑センセーション (やる気-3)": "* __**やる気**__消費3\n* __**好印象**__+5\n* __**スキルカード使用数追加**__+1\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)星屑センセーション+ (やる気-3)": "* __**やる気**__消費3\n* __**好印象**__+7\n* __**スキルカード使用数追加**__+1\n* スキルカードを引く\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ノートの端の決意 ♡-4": "* __**好印象**__+3\n* __**やる気**__+3\n* __**消費体力減少**__3ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)ノートの端の決意+ ♡-4": "* __**好印象**__+5\n* __**やる気**__+3\n* __**消費体力減少**__3ターン\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)手書きのメッセージ (好印象-2)": "* __**好印象**__消費2\n* __**元気**__+9\n* __**元気**__+9\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)手書きのメッセージ+ (好印象-1)": "* __**好印象**__消費1\n* __**元気**__+10\n* __**元気**__+10\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)トキメキ ♡-10": "* __**好印象**__+8\n* __**やる気**__+5\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)トキメキ+ ♡-9": "* __**好印象**__+10\n* __**やる気**__+6\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)虹色ドリーマー ♡-9": "* __**好印象**__+1\n* 以降、ターン終了時、__**好印象**__が3以上の場合、__**好印象**__+3\n* __**レッスン中1回**__ __**重複不可**__",
    "(M)虹色ドリーマー+ ♡-9": "* __**好印象**__+4\n* 以降、ターン終了時、__**好印象**__が3以上の場合、__**好印象**__+3\n* __**レッスン中1回**__ __**重複不可**__",

    # SSR Idol
    # SSR Support
}

SKILLCARD_FLASHCARD = SKILLCARD_FLASHCARD_FREQ | {
    "desc": "すべてのスキルカード",

    # R Idol
    "(A)新進気鋭 ♡-5([学園生活]花海咲季)": "* パラメータ+17\n* __**レッスン中1回**__ __**重複不可**__",
    "(A)新進気鋭+ ♡-5([学園生活]花海咲季)": "* パラメータ+25\n* __**レッスン中1回**__ __**重複不可**__",
    # ...

    # SR Idol
    # SR Support
    # SSR Support
}


def quiz_from(flashcard_dict, ques_using_key):
    """ Generates a quiz text from a random pair in the dict.
        If ques_using_key, uses key as question and value as answer.
        Otherwise, uses value as question and key as answer.
        Returns a pair (question_only_text, full_text).
    """
    header_q_only = f"「{flashcard_dict["desc"]}」の単語帳から出題します！\n"
    header_full = "正解はこちら！\n"

    key = random.choice(list( flashcard_dict.keys() - {"desc"} ))
    value = flashcard_dict[key]
    if ques_using_key:
        return (
            header_q_only + f"名称：**{key}**\n効果：？？？",
            header_full + f"名称：**{key}**\n効果：\n{value}"
        )
    else:
        return (
            header_q_only + f"名称：？？？\n効果：\n{value}",
            header_full + f"名称：**{key}**\n効果：\n{value}"
    )


class QuesPostView(discord.ui.View):
    """ View for quiz including both question and answer. """
    def __init__(self, flashcard_dict, ques_using_key):
        """ `flashcard_dict` is a dict of card names and effects.
            `ques_using_key` is a boolean indicating whether
            question uses dict key; see `quiz_from()`.
        """
        super().__init__(timeout=None)
        self.flashcard_dict = flashcard_dict
        self.ques_using_key = ques_using_key

    @discord.ui.button(label="新しく出題", style=discord.ButtonStyle.blurple, row=1)
    async def new_quiz_callback(self, interaction: discord.Interaction, button: discord.ui.Button):
        new_ques_text, new_full_text = quiz_from(self.flashcard_dict, self.ques_using_key)
        await interaction.response.edit_message(content=new_ques_text, view=QuesPreView(self.flashcard_dict, self.ques_using_key, new_full_text))
    
    @discord.ui.button(label="出題モード変更", style=discord.ButtonStyle.grey, row=1)
    async def opposite_quiz_callback(self, interaction: discord.Interaction, button: discord.ui.Button):
        new_ques_text, new_full_text = quiz_from(self.flashcard_dict, not self.ques_using_key)
        await interaction.response.edit_message(content=new_ques_text, view=QuesPreView(self.flashcard_dict, not self.ques_using_key, new_full_text))

class QuesPreView(QuesPostView):
    """ View for quiz before answer is revealed. """
    def __init__(self, flashcard_dict, ques_using_key, full_text):
        """ `flashcard_dict` is a dict of card names and effects.
            `ques_using_key` is a boolean indicating whether
            question uses dict key; see `quiz_from()`.
            `full_text` is a string of full quiz text.
        """
        super().__init__(flashcard_dict, ques_using_key)
        self.full_text = full_text

    @discord.ui.button(label="答えを見る", style=discord.ButtonStyle.green, row=0)
    async def post_view_callback(self, interaction: discord.Interaction, button: discord.ui.Button):
        await interaction.response.edit_message(content=self.full_text, view=QuesPostView(self.flashcard_dict, self.ques_using_key))


class FlashcardCog(commands.Cog):
    """ A cog for flashcard activities. """
    def __init__(self, bot: commands.Bot):
        self.bot = bot

    # Class scope command group
    group = discord.app_commands.Group(name="flashcard", description="学マス単語帳")

    @group.command(name="drink", description="Pドリンクの単語帳から出題")
    @discord.app_commands.rename(ephemeral="表示設定")
    async def p_drink_flashcard(self, interaction: discord.Interaction, ephemeral: EphemeralEnum = EphemeralEnum.T):
        """ Interactive quiz from P-drink flashcards. """
        new_ques_text, new_full_text = quiz_from(_FLASHCARD_P_DRINKS, True)
        await interaction.response.send_message(
            content=new_ques_text,
            view=QuesPreView(_FLASHCARD_P_DRINKS, True, new_full_text),
            ephemeral=bool(ephemeral.value)
        )

    @group.command(name="item", description="よく使われるPアイテムの単語帳から出題")
    @discord.app_commands.rename(ephemeral="表示設定")
    async def p_item_flashcard(self, interaction: discord.Interaction, ephemeral: EphemeralEnum = EphemeralEnum.T):
        """ Interactive quiz from P-item flashcards. """
        new_ques_text, new_full_text = quiz_from(_FLASHCARD_P_ITEMS_FREQ, True)
        await interaction.response.send_message(
            content=new_ques_text,
            view=QuesPreView(_FLASHCARD_P_ITEMS_FREQ, True, new_full_text),
            ephemeral=bool(ephemeral.value)
        )
    
    @group.command(name="item-all", description="すべてのPアイテムの単語帳から出題")
    @discord.app_commands.rename(ephemeral="表示設定")
    async def p_item_all_flashcard(self, interaction: discord.Interaction, ephemeral: EphemeralEnum = EphemeralEnum.T):
        """ Interactive quiz from all P-item flashcards. """
        new_ques_text, new_full_text = quiz_from(_FLASHCARD_P_ITEMS, True)
        await interaction.response.send_message(
            content=new_ques_text,
            view=QuesPreView(_FLASHCARD_P_ITEMS, True, new_full_text),
            ephemeral=bool(ephemeral.value)
        )
    
    @group.command(name="skill", description="よく使われるスキルカードの単語帳から出題")
    @discord.app_commands.rename(ephemeral="表示設定")
    async def skillcard_flashcard(self, interaction: discord.Interaction, ephemeral: EphemeralEnum = EphemeralEnum.T):
        """ Interactive quiz from skillcard flashcards. """
        new_ques_text, new_full_text = quiz_from(SKILLCARD_FLASHCARD_FREQ, True)
        await interaction.response.send_message(
            content=new_ques_text,
            view=QuesPreView(SKILLCARD_FLASHCARD_FREQ, True, new_full_text),
            ephemeral=bool(ephemeral.value)
        )
    
    @group.command(name="help", description="学マス単語帳のヘルプを表示")
    async def help_flashcard(self, interaction: discord.Interaction):
        """ Command for help with `/flashcard`. """
        timestamp_modified = int(os.path.getmtime(__file__))

        await interaction.response.send_message(
            "こちらは学マスP図鑑の単語帳ツールです。学マス用語の暗記にぜひ活用してください！\n"
            "* `/flashcard drink`：「Pドリンク」の単語帳から出題\n"
            "* `/flashcard item`：「よく使われるPアイテム」の単語帳から出題\n"
            "* `/flashcard item-all`：「すべてのPアイテム」の単語帳から出題\n"
            "* `/flashcard skill`：「よく使われるスキルカード」の単語帳から出題\n"
            #"* `/flashcard skill-all`：「すべてのスキルカード」の単語帳から出題\n"
            f"更新日：<t:{timestamp_modified}:D>",
            ephemeral=True
        )


async def setup(bot):
    await bot.add_cog(FlashcardCog(bot))
